/*-----------------------------------------------------------------------------------------
**
** 版权(Copyright): Inory, 2021~ 
**
** 文件名(File Name): main.c
**
** 描述(Description): 本文件定义应用软件的入口函数
**
** 包含的函数(Including Function): 
**
** 设计注记(Design Annotation):
**
** 作者(Author):
**		Inory, 2021年7月30日创建本文件
**
** 更改历史(Modification Histroy):
**		2021年7月30日 创建本文件 by Inory
**		$Revision$
**		$Date&
**		$Author$
**		$Log$
**
**-----------------------------------------------------------------------------------------
*/
/*-----------------------------------------------------------------------------------------
**										   Include
**-----------------------------------------------------------------------------------------
*/
/*-----------------------------------------------------------------------------------------
**									 Function Definition
**-----------------------------------------------------------------------------------------
*/
/*.BH--------------------------------------------------------------------------------------
**
** 函数名(Function Name): main
**
** 描述(Description): 本函数实现程序入口,创建控制器实例并运行功能
**
** 输入参数(Input Parameter): 
**
** 输出参数(Output Parameter):
**
** 返回值(Return Value):
**
** 设计注记(Design Annotation):
**
** 更改历史(Modification Histroy):
**		2021年7月30日 创建本文件 by Inory
**		$Revision$
**
**.EH--------------------------------------------------------------------------------------
*/
int main(void)
{
	return 0;
}
/* END of main */
